Revit 2027 API
BrowserOrganizationType Enumeration
 Enumerated type representing the type of browser organization.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BrowserOrganizationType
Public Enumeration BrowserOrganizationType
public enum class BrowserOrganizationType
type BrowserOrganizationType
Members
Member name | Value | Description
PanelSchedules | 4 |  The browser organization definition for panel schedules.
Schedules | 3 |  The browser organization definition for schedules.
Sheets | 1 |  The browser organization definition for sheets.
Views | 0 |  The browser organization definition for views.
See Also
Reference
Autodesk.Revit.DB Namespace